/**
 * Хранилище шаблонов для генератора паролей.
 *
 */
SymStorage = [
    {
        desc: 'Латинский алфавит минус буквы, похожие на цифры. Верхний регистр.',
        symbols: [
            0, 1, 2, 3, 4, 5, 6, 7, 8, 9,
            'A', 'C', 'D', 'E', 'F', 'G', 'J', 'H', 'K', 'L', 'M', 'N', 'P', 'Q',
            'R', 'T', 'V', 'U', 'W', 'X', 'Y', 'Z'
        ]
    },
    {
        desc: 'Латинский алфавит + цифры. Верхний регистр.',
        symbols: [
            0, 1, 2, 3, 4, 5, 6, 7, 8, 9,
            'Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', 'A', 'S', 'D',
            'F', 'G', 'H', 'J', 'K', 'L', 'Z', 'X', 'C', 'V', 'B', 'N', 'M'
        ]
    },
    {
        desc: 'Английский алфавит + цифры, оба регистра.',
        symbols: [
            0, 1, 2, 3, 4, 5, 6, 7, 8, 9,
            'q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p', 'a', 's', 'd',
            'f', 'g', 'h', 'j', 'k', 'l', 'z', 'x', 'c', 'v', 'b', 'n', 'm',
            'Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', 'A', 'S', 'D',
            'F', 'G', 'H', 'J', 'K', 'L', 'Z', 'X', 'C', 'V', 'B', 'N', 'M'
        ]
    },
    {
        desc: 'Английский алфавит + цифры + некоторые символы, оба регистра.',
        symbols: [
            0, 1, 2, 3, 4, 5, 6, 7, 8, 9,
            '~', '!', '@', '$', '&', '_', '+', '?', 'q', 'w', 'e', 'r', 't',
            'y', 'u', 'i', 'o', 'p', 'a', 's', 'd', 'f', 'g', 'h', 'j', 'k',
            'l', 'z', 'x', 'c', 'v', 'b', 'n', 'm', 'Q', 'W', 'E', 'R', 'T',
            'Y', 'U', 'I', 'O', 'P', 'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K',
            'L', 'Z', 'X', 'C', 'V', 'B', 'N', 'M'
        ]
    },
    {
        desc: 'Английский алфавит + цифры + символы, оба регистра.',
        symbols: [
            0, 1, 2, 3, 4, 5, 6, 7, 8, 9,
            '~', '!', '@', '#', '$', '%', '^', '&', '*', '(', ')', '_', '+',
            '|', '<', '>', '?', '"', ':', '{', '}', 'q', 'w', 'e', 'r', 't',
            'y', 'u', 'i', 'o', 'p', 'a', 's', 'd', 'f', 'g', 'h', 'j', 'k',
            'l', 'z', 'x', 'c', 'v', 'b', 'n', 'm', 'Q', 'W', 'E', 'R', 'T',
            'Y', 'U', 'I', 'O', 'P', 'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K',
            'L', 'Z', 'X', 'C', 'V', 'B', 'N', 'M'
        ]
    }
];

// Quick & dirty
/**
var s = "~!@#$%^&*()_+|<>?\":{}qwertyuiopasdfghjklzxcvbnmQWERTYUIOPASDFGHJKLZXCVBNM",
t = "", i = 0;
for (i = 0; i < s.length; i++){
    t+= "', '" + s[i]
}
console.log( ("'" + t + "'") )
*/